using System;
using System.Collections.Generic;
using System.Text;
using System.Drawing;

namespace ShuEki
{
    // 筮竹クラス・筮竹の計算結果・途中の状態を記憶するクラス
    class zeichiku
    {
        public byte take = 50;
        public byte ka;
        public byte kai;
        public byte joui;
        public byte honka;
        public byte shika;
        public byte target = 0;
    }

    // 陰陽クラス・陰陽のシンボルを記憶するクラス
    class yinyan
    {
        public const int YIN = 0;
        public const int YAN = 1;
        public static Image YIN_BMP;
        public static Image YAN_BMP;
        public static Image YIN_CHANGE_BMP;
        public static Image YAN_CHANGE_BMP;
        public static Image BLANK_BMP;
    }

    // 八卦の陰陽を判断するクラス
    abstract class hakka
    {
        public const byte KEN   = 0x07;
        public const byte DA    = 0x03;
        public const byte RI    = 0x05;
        public const byte SHIN  = 0x01;
        public const byte SON   = 0x06;
        public const byte KAN   = 0x02;
        public const byte GON   = 0x04;
        public const byte KON   = 0x00;
    }

    // 六十四卦
    abstract class rikujusika
    {
        public static string[] all =
        {
			"坤爲地",	// 00
			"地雷復",	// 01
	        "地水師",	// 02
	        "地澤臨",	// 03
	        "地山謙",	// 04
            "地火明夷",	// 05
            "地風升",	// 06
            "地天泰",	// 07
            "雷地豫",	// 08
            "震爲雷",	// 09
            "雷水解",	// 10
            "雷澤歸妹",	// 11
            "雷山小過",	// 12
            "雷火豐",	// 13
            "雷風恒",	// 14
            "雷天大壯",	// 15
            "水地比",	// 16
            "水雷屯",	// 17
            "習坎", 	// 18
            "水澤節",	// 19
            "水山蹇",	// 20
            "水火既濟",	// 21
            "水風井",	// 22
            "水天需",	// 23
            "澤地萃",	// 24
            "澤雷隨",	// 25
            "澤水困",	// 26
            "兌爲澤",	// 27
            "澤山咸",	// 28
            "澤火革", 	// 29
            "澤風大過",	// 30
            "澤天夬",	// 31
            "山地剥",	// 32
            "山雷頤",	// 33
            "山水蒙",	// 34
            "山澤損",	// 35
            "艮爲山",	// 36
            "山火賁",	// 37
            "山風蠱",	// 38
            "山天大畜",	// 39
            "火地晉",	// 40
            "火雷噬嗑",	// 41
            "火水未濟",	// 42
            "火澤睽",	// 43
            "火山旅",	// 44
            "離爲火",	// 45
            "火風鼎",	// 46
            "火天大有", // 47
            "風地觀",   // 48
            "風雷益",	// 49
            "風水渙",	// 50
            "風澤中孚",	// 51
            "風山漸",	// 52
            "風火家人",	// 53
            "巽爲風",	// 54
            "風天小畜",	// 55
	        "天地否",   // 56
	        "天雷无妄",	// 57
	        "天水訟",	// 58
	        "天澤履",	// 59
            "天山遯",   // 60
            "天火同人",	// 61
            "天風姤",   // 62
            "乾爲天"    // 63
        };

        public static string[] youso =
        {
            "",
            "乾",
            "兌",
            "離",
            "震",
            "巽",
            "坎",
            "艮",
            "坤"
        };

        public static string[] henkou =
        {
			"初",
			"二",
	        "三",
            "四",
            "五",
            "上"
        };
        
        public static string[] kuroku =
        {
            "六",
            "九"
        };

        public static string[] genbun_taii = 
        {
            "坤元亨。利牝馬之貞。君子有攸往。先迷後得。主利。西南朋得。東北喪朋。安貞吉。初六履霜堅冰至。六二、直方大不習无不利。六三、含章、可貞或從王事、无成有終。六四、フクロを括る、无咎无譽。六五、黄裳元吉。上六、龍戰于野、其血玄黄。用六、利永貞。",	// 00
            "復、亨。出入无疾。朋來无咎反復。其道。七日來復。利有攸往。初九不遠復。无祇悔。元吉。六二、休復。吉。六三、頻復。厲无咎。六四、中行獨復。六五、敦復。无悔。上六、迷復。凶。有災眚。用行師終有大敗、以其國君凶。至于十年不克征。",	// 01
	        "師。貞丈人、吉、无咎。初六、師出以律。否臧凶。九二在師中。吉无咎。王三錫命。六三師或輿尸。凶。六四師左次无咎。六五田有禽。利執言无咎。長子帥師。弟子輿尸貞凶。上六大君有命。開國承家。小人勿用。",	// 02
	        "臨、元亨、利貞。至于八月有凶。初九、咸臨。貞吉。九二、咸臨吉无不利。六三、甘臨。无攸利。既憂之。无咎。六四、至臨。无咎。六五、知臨。大君之宜吉。上六、敦臨。吉无咎。",	// 03
	        "謙亨。君子有終。初六謙謙君子。用渉大川吉。六二鳴謙。貞吉。九三、勞謙。君子有終吉。六四、无不利撝謙。六五不富以其鄰。利用侵伐、无不利。上六鳴謙利用行師征邑國。",	// 04
            "明夷、利艱貞。初九明夷于飛埀其翼。君子于行三日不食。有攸往、主人有言。六二、明夷。夷于左股。用拯馬壯吉。九三、明夷于南狩。得其大首。不可疾貞。六四、入于左腹。獲明夷之心于出門庭。六五、箕子之明夷利貞。上六、不明晦。初登于天後入于地。",	// 05
            "升、元亨。用見大人。勿恤南征吉。初六、允升大吉。九二、孚乃利用禴。无咎。九三升虚邑。六四、王用亨于岐山。吉无咎。六五、貞吉升階。上六、冥升。利于不息之貞。",	// 06
            "泰小往大來。吉亨。初九拔茅茹以其彙征吉。九二包荒。用馮河。不遐遺。朋亡。得尚于中行。九三、无平不陂。无往不復。艱貞无咎勿恤其孚。于食有福。六四翩翩不富以其鄰不戒以孚。六五、帝乙歸妹。以祉元吉。上六城復于隍。勿用師。自邑告命貞吝。",	// 07
            "豫利建侯行師。初六、鳴豫。凶。六二、介于石。不終日。貞吉。六三豫、悔。遲有悔。九四由豫。大有得。勿疑朋盍簪。六五貞疾恒不死。上六冥豫。成有渝。无咎。",	// 08
            "震亨震來虩虩。笑言啞啞。震驚百里、不喪鬯。初九、震來虩虩後笑。言啞啞。吉。六二震來厲。億喪貝躋于九陵。勿逐、七日得。六三、震蘇蘇。震行无眚。九四、震遂泥。六五震往來厲。意无喪有事。上六、震索索視矍矍征凶。震不于其躳。于其鄰无咎婚、媾有言。",	// 09
            "解、利西南无所往、其來復吉有攸往夙吉。初六无咎。九二、田獲三狐。得黄矢。貞吉。六三、負且乘。致冦至。貞吝。九四、解而拇朋至斯孚。六五、君子維有解吉。有孚于小人。上六、公用射隼于高墉之上。獲之无不利。",	// 10
            "歸妹。征凶。无攸利。初九、歸妹以娣。跛能履征吉。九二、眇能視。利幽人之貞。六三、歸妹以須、反歸以娣。九四、歸妹愆期遲歸有時。六五、帝乙歸妹。其君之袂、不如其娣之袂良。月幾望。吉。上六、女承筐无實、士刲羊无血无攸利。",	// 11
            "小過亨。利貞可小事。不可大事飛鳥遺之音。不宜上、宜下。大吉。初六、飛鳥以凶。六二、過其祖。遇其妣。不及其君。遇其臣。无咎。九三、弗過防之。從或戕之。凶。九四、无咎。弗過遇之。往厲必戒。勿用永貞。六五、密雲不雨。自我西郊。公弋取彼在穴。上六、弗遇過之。飛鳥離之凶。是謂災眚。",	// 12
            "豐。亨。王假之。勿憂宜日中。初九、遇其配主雖旬无咎。往有尚。六二豐其蔀。日中見斗。往得疑疾有孚發若吉。九三、豐其沛。日中見沫折其右肱。无咎。九四豐其蔀。日中見斗。遇其夷主。吉。六五、來章有慶譽吉。上六、豐其屋蔀其家闚其戸、闃其无人三歳不覿凶。",	// 13
            "恒亨。无咎。利貞。利有攸往。初六、浚恒。貞凶。无攸利。九二、悔亡。九三、不恒其徳或承之羞貞吝。九四、田无禽。六五、恒其徳貞。婦人吉夫子凶。上六、振恒凶。",	// 14
            "大壯、利貞。初九、壯于趾征凶有孚。九二貞吉。九三小人用壯。君子用罔貞厲。羝羊觸藩。羸其角。九四、貞吉、悔亡。藩決不羸。壯于大輿之輹。六五、喪羊于易。无悔。上六、羝羊觸藩。不能退、不能遂。无攸利、艱則吉。",	// 15
            "比吉。原筮元永貞、无咎。不寧方來後夫凶。初六、有孚比之。无咎有孚盈缶終來。有它吉。六二比之自内。貞吉。六三、比之匪人。六四外比之貞吉。九五顯比。王用三驅失前禽。邑人不誡吉。上六、比之无首。凶。",	// 16
            "屯、元亨。利貞。勿用有攸往利建侯。初九、磐桓利居貞。利建侯。六二、屯如、邅如乘馬班如匪冦婚媾。女子貞不字十年乃字。六三、即鹿无虞。惟入于林中。君子幾不如舎。往吝。六四、乘馬班如。求婚媾往、吉无不利。九五、屯其膏。小貞吉、大貞凶。上六、乘馬班如。泣血漣如。",	// 17
            "習坎有孚維心亨。行有尚。初六、習坎。入于坎窞。凶。九二、坎有險求小得。六三、來之坎坎險且枕。入于坎窞。勿用。六四、樽酒簋。貳用缶。納約自牖。終无咎。九五、坎不盈。祇既平。无咎。上六、係用徽纆寘于叢棘。三歳不得。凶。", 	// 18
            "節。亨。苦節、不可貞。初九、不出戸庭。无咎。九二、不出門庭凶。六三、不節若則嗟若无咎。六四、安節。亨。九五、甘節吉。往有尚。上六、苦節。貞凶。悔亡。",	// 19
            "蹇利西南。不利東北。利見大人貞吉。初六、往蹇來譽。六二、王臣蹇蹇。匪躳之故。九三、往蹇、來反。六四、往蹇、來連。九五、大蹇朋來。上六、往蹇、來碩吉利見大人。",	// 20
            "既濟。亨小利貞。初吉。終亂。初九、曳其輪。濡其尾。无咎。六二、婦。喪其茀。勿逐。七日得。九三、高宗伐鬼方。三年克之。小人勿用。六四繻有衣袾。終日戒。九五、東鄰殺牛、不如西鄰之禴祭。實受其福。上六、濡其首厲。",	// 21
            "井、改邑不改井。无喪无得。往來井井。汔至亦未繘井羸其瓶、凶。初六、井泥不食舊井无禽。九二、井谷射鮒。甕敝漏。九三、井渫不食。爲我心惻可用汲。王明竝受其福。六四、井甃。无咎。九五、井冽寒泉食。上六、井収勿幕有孚元吉。",	// 22
            "需有孚光亨。貞吉。利渉大川。初九需于郊。利用恒无咎。九二、需于沙。小有言、終吉。九三、需于泥。致冦至。六四、需于血。出自穴。九五需于酒食貞吉。上六、入于穴有不速之客三人來。敬之終吉。",	// 23
            "萃、亨。王假有廟。利見大人亨。利貞用大牲吉。利有攸往。初六、有孚不終。乃亂乃萃。若號、一握爲笑。勿恤往、无咎。六二引吉、无咎。孚乃利用禴。六三、萃如嗟如。无攸利。往无咎。小吝。九四、大吉、无咎。九五、萃有位。无咎。匪孚、元永貞悔亡。上六、齎咨涕洟无咎。",	// 24
            "隨元亨利貞。无咎。初九、官有渝。貞吉。出門交有功。六二、係小子、失丈夫。六三係丈夫失小子。隨有求得利居貞。九四隨有獲。貞凶。有孚在道以明何咎。九五、孚于嘉吉。上六拘係之乃從維之王用亨于西山。",	// 25
            "困、亨。貞、大人吉。无咎。有言不信。初六、臀困于株木。入于幽谷三歳不覿。九二困于酒食朱紱方來。利用亨祀征凶。无咎。六三、困于石。據于蒺藜。入于其宮、不見其妻。凶。九四、來徐徐。困于金車、吝、有終。九五、劓刖。困于赤紱乃徐有説。利用祭祀。上六、困于葛藟于臲卼。曰動悔。有悔。征吉。",	// 26
            "兌。亨利貞。初九和兌。吉。九二、孚兌吉悔亡。六三、來兌凶。九四、商兌未寧。介疾有喜。九五孚于剥有厲。上六、引兌。",	// 27
            "咸、亨。利貞。取女吉。初六、咸其拇。六二、咸其腓。凶。居吉。九三、咸其股。執其隨。往吝。九四、貞吉悔亡。憧憧往來、朋從爾思。九五、咸其脢。无悔。上六、咸其輔頬舌。",	// 28
            "革、已日乃孚。元亨。利貞。悔亡。初九、鞏用黄牛之革。六二、已日乃革之。征吉无咎。九三、征凶。貞厲革言三就有孚。九四、悔亡。有孚改命。吉。九五、大人虎變。未占有孚。上六、君子豹變。小人革面。征凶。居貞吉。", 	// 29
            "大過、棟橈。利有攸往。亨。初六、藉用白茅。无咎。九二、枯楊生稊。老夫得其女妻。无不利。九三、棟橈。凶。九四、棟隆。吉有它吝。九五、枯楊生華。老婦得其士夫。无咎无譽。上六、過渉滅頂凶。无咎。",	// 30
            "夬、揚于王庭。孚號有厲。告自邑。不利即戎、利有攸往。初九、壯于前趾。往不勝爲咎。九二、惕號。莫夜有戎勿恤。九三壯于頄有凶。君子夬夬。獨行遇雨。若濡有慍。无咎。九四、臀无膚。其行次且牽羊悔亡聞言不信。九五、莧陸夬夬中行无咎。上六、无號。終有凶。",	// 31
            "剥、不利有攸往。初六、剥牀以足。蔑貞凶。六二、剥牀以辨。蔑貞凶。六三、剥之。无咎。六四、剥牀以膚。凶。六五、貫魚以宮人寵。无不利。上九、碩果不食。君子得輿。小人剥廬。",	// 32
            "頤、貞吉。觀頤自求口實。初九、舎爾靈龜。觀我朶頤凶。六二、顚頤拂經。于丘頤征凶。六三、拂頤。貞凶。十年勿用。无攸利。六四、顚頤吉。虎視眈眈。其欲逐逐无咎。六五、拂經居貞吉不可渉大川。上九、由頤。厲吉。利渉大川。",	// 33
            "蒙亨。匪我求童蒙。童蒙求我初筮告再三瀆瀆則不告。利貞。初六發蒙。利用刑人。用説桎梏。以往吝。九二、包蒙吉。納婦吉。子克家。六三勿用取女見金夫、不有躳擊。无攸利。六四、困蒙。吝。六五、童蒙吉。上九、蒙。不利爲冦。利禦冦。",	// 34
            "損、有孚元吉。无咎。可貞利有攸往曷之用。二簋可用享。初九、已事遄往。无咎。酌損之。九二、利貞。征凶。弗損益之。六三、三人行、則損一人一人行則得其友。六四、損其疾。使遄。有喜无咎。六五或益之十朋之龜弗克違。元吉。上九弗損益之。无咎。貞吉利有攸往。得臣无家。",	// 35
            "艮其背不獲其身。行其庭、不見其人无咎。初六、艮其趾。无咎。利永貞。六二、艮其腓。不拯其隨。其心不快。九三、艮其限列其夤厲薫心。六四、艮其身无咎。六五、艮其輔言有序悔亡。上九、敦艮吉。",	// 36
            "賁、亨。小利有攸往。初九、賁其趾。舎車而徒。六二、賁其須。九三、賁如濡如永貞吉。六四、賁如皤如。白馬翰如。匪寇婚媾。六五、賁于丘園。束帛戔戔。吝終吉。上九白、賁无咎。",	// 37
            "蠱元亨利渉大川。先甲三日後甲三日。初六幹父之蠱。有子、考无咎。厲終吉。九二、幹母之蠱不可貞。九三、幹父之蠱。小有悔。无大咎。六四裕父之蠱。往見吝。六五幹父之蠱。用譽。上九不事王侯。高尚其事。",	// 38
            "大畜、利貞。不家食吉。利渉大川。初九有厲。利已。九二、輿説輹。九三、良馬逐。利艱貞、日閑輿衞、利有攸往。六四、童牛之牿。元吉。六五獖豕之牙。吉。上九、何天之衢。亨。",	// 39
            "晉、康侯用錫馬蕃庶。晝日三接。初六、晉如摧如。貞吉罔孚、裕无咎。六二、晉如愁如貞吉受玆介福于其王母。六三、衆允悔亡。九四、晉如鼫鼠貞厲。六五、悔亡。失得勿恤往吉无不利。上九、晉其角。維用伐邑。厲吉无咎。貞吝。",	// 40
            "噬嗑、亨。利用獄。初九屨、校。滅趾。无咎。六二、噬膚滅鼻。无咎。六三、噬腊肉遇毒小吝无咎。九四、噬乾胏。得金矢利艱貞吉。六五、噬乾肉。得黄金。貞厲无咎。上九、何。校滅耳。凶。",	// 41
            "未濟。亨。小狐汔濟、濡其尾无所利。初六、濡其尾。吝。九二、曳其輪。貞吉。六三未濟征凶。利渉大川。九四貞吉、悔亡。震用伐鬼方三年有賞于大國。六五、貞吉。无悔。君子之光有孚。吉。上九、有孚于飲酒。无咎。濡其首有孚失是。",	// 42
            "睽、小事吉。初九、悔亡。喪馬勿逐自復。見惡人无咎。九二遇主于巷。无咎。六三、見輿曳。其牛掣。其人天且劓。无初有終。九四睽孤。遇元夫交孚。厲无咎。六五、悔亡厥宗噬膚。往何咎。上九、睽孤。見豕負塗載鬼一車。先張之弧、後説之弧。匪冦婚媾往遇雨則吉。",	// 43
            "旅。小亨。旅貞吉。初六、旅瑣瑣斯其所取災。六二、旅即次懷其資。得童僕貞。九三、旅焚其次喪其童僕貞厲。九四、旅于處。得其資斧。我心不快。六五、射雉一矢亡。終以譽命。上九鳥焚其巣。旅人先笑後號咷喪牛于易。凶。",	// 44
            "離、利貞亨。畜牝牛。吉。初九、履錯然。敬之无咎。六二、黄離。元吉。九三、日昃之離。不鼓缶而歌、則大耊之嗟凶。九四、突如其來如。焚如、死如、棄如。六五、出涕沱若戚嗟若吉。上九、王用出征。有嘉折首。獲匪其醜无咎。",	// 45
            "鼎、元吉亨。初六、鼎顛趾。利出否得妾以其子。无咎。九二、鼎有實。我仇有疾、不我能即。吉。九三、鼎耳革。其行塞。雉膏不食。方雨虧悔。終吉。九四、鼎折足。覆公餗。其形渥。凶。六五、鼎黄耳金鉉。利貞上九、鼎玉鉉。大吉无不利。",	// 46
            "大有元亨。初九无交害匪咎艱則无咎。九二大車以載。有攸往无咎。九三公用亨于天子。小人弗克。九四、匪其彭无咎。六五厥孚交如威如吉。上九自天祐之吉无不利。", // 47
            "觀、盥而不薦。有孚若。初六、童觀。小人无咎。君子吝。六二觀、利女貞。六三、觀我生進退。六四觀國之光。利用賓于王。九五、觀我生。君子无咎。上九、觀其生。君子无咎。",   // 48
            "益、利有攸往。利渉大川。初九、利用爲大作。元吉、无咎。六二、或益之十朋之龜弗克違永貞吉。王用享于帝。吉。六三益之用凶事。无咎。有孚中行。告公用圭。六四、中行告公從、利用爲依遷國。九五、有孚惠心。勿問元吉。有孚惠我、徳。上九、莫益之、或擊之。立心勿恒凶。",	// 49
            "渙。亨。王假有廟。利渉大川利貞。初六、用拯馬壯。吉。九二、渙奔其机、悔亡。六三、渙其厲。无悔。六四、渙其羣。元吉。渙有丘匪夷所思。九五、渙汗其大號。渙王居。无咎。上九、渙其血去逖出无咎。",	// 50
            "中孚、豚魚吉。利渉大川利貞。初九、虞吉。有它、不燕。九二、鳴鶴在陰其子和之。我有好爵。吾與爾靡之。六三、得敵。或鼓。或罷。或泣。或歌。六四、月幾望。馬匹亡无咎。九五、有孚攣如。无咎。上九、翰音登于天。貞凶。",	// 51
            "漸女歸吉。利貞。初六、鴻漸于干。小子厲。有言无咎。六二、鴻漸于磐飲食衎衎吉。九三鴻漸于陸。夫征不復婦孕不育凶。利禦寇。六四、鴻漸于木或得其桷。无咎。九五鴻漸于陵。婦三歳不孕。終莫之勝。吉。上九、鴻漸于陸、其羽可用爲儀吉。",	// 52
            "家人、利女貞。初九、閑有家、悔亡。六二无攸遂在中饋。貞吉。九三、家人啊啊悔厲吉。婦子嘻嘻終吝。六四、富家大吉。九五王假有家勿恤吉。上九、有孚威如。終吉。",	// 53
            "巽。小亨。利有攸往、利見大人。初六、進退利武人之貞。九二、巽在牀下。用史巫紛若吉无咎。九三、頻巽吝。六四、悔亡。田獲三品。九五、貞吉。悔亡无不利。无初有終。先庚三日、後庚三日吉。上九、巽在牀下、喪其資斧。貞凶。",	// 54
            "小畜亨。密雲不雨自我西郊。初九復自道、何其咎。吉。九二牽復吉。九三輿説輻夫妻反目。六四有孚。血去出。无咎。九五有孚攣如。富以其鄰。上九既雨既處。尚徳載婦貞惕月幾望君子征凶。",	// 55
	        "否。之匪人不利君子貞。大往小來。初六拔茅茹以其彙貞吉亨。六二包承。小人吉。大人否亨。六三包羞。九四有命。无咎。疇離祉。九五休否。大人吉。其亡其亡、繫于苞桑。上九傾否先否後喜。",   // 56
	        "无妄、元亨、利貞。其匪正有眚、不利有攸往。初九、无妄。往吉。六二、不耕穫、不菑畭則利有攸往。六三、无妄之災。或繁之牛。行人之得。邑人之災。九四、可貞。无咎。九五、无妄之疾。勿藥有喜。上九无妄行。有无攸利。",	// 57
	        "訟。有孚窒惕中吉終凶。利見大人不利渉大川。初六、不永所事。小有言終吉。九二不克訟。歸而逋。其邑人三百戸。无眚。六三食舊徳、貞厲終吉。或從王事无成。九四不克訟復即命。渝安貞吉。九五訟元吉。上九或錫之鞶帶。終朝三虒之。",	// 58
	        "履虎尾不咥人。亨。初九素履。往无咎。九二履道坦坦。幽人貞吉。六三、眇能視跛能履。履虎尾咥人凶。武人爲于大君。九四履虎尾愬愬終吉。九五夬履。貞厲。上九視履考祥。其旋元吉。",	// 59
            "遯、亨。小利貞。初六遯尾。厲。勿用有攸往。六二、執之用黄牛之革莫之勝説。九三係遯有疾厲畜臣妾吉。九四、好遯。君子吉小人否。九五、嘉遯。貞吉。上九、肥遯无不利。",   // 60
            "同人于野。亨。利渉大川。利君子貞。初九同人于門。无咎。六二、同人于宗吝。九三、伏戎于莽。升其高陵。三歳不興。九四乘其墉弗克攻吉。九五、同人先號咷而後笑。大師充相遇。上九同人于郊无悔。",	// 61
            "姤、女壯。勿用取女。初六、繫于金柅。貞吉。有攸往見凶。羸豕孚蹢躅。九二包有魚。无咎。不利賓。九三、臀无膚。其行次且厲、无大咎。九四、包无魚。起凶。九五、以杞包瓜含章有隕自天。上九、姤其角。吝。无咎。",   // 62
            "乾、元、亨、利、貞。初九、潜龍。勿用。九二、見龍在田利見大人。九三、君子終日乾乾、夕惕若厲无咎。九四、或躍在淵。无咎。九五飛龍在天利見大人。上九、亢龍有悔。用九、見羣龍无首吉。"    // 63
        };

        public static string[] genbun_tanden = 
        {
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        };

    }
}
